; domain
(define (domain joint_visitall-assistance_domain)
(:requirements :typing :action-costs)

(:types
    place - object
)

(:constants
)

(:predicates
    (prime_turn)
    (supporter_turn)
    (connected ?x ?y -  place)
    (not-connected ?x ?y -  place)
    (at-prime ?x -  place)
    (visited ?x -  place)
)

(:functions
    (total-cost) - number
)

(:action sup_create-connection
    :parameters (?a ?b - place)
    :precondition (and
        (supporter_turn)
        (not-connected ?a ?b)
    )
    :effect (and
        (prime_turn)
        (not (supporter_turn))
        (connected ?a ?b)
        (not (not-connected ?a ?b))
        (increase (total-cost) 1.0)
    )
)

(:action pri_move
    :parameters (?curpos ?nextpos - place)
    :precondition (and
        (prime_turn)
        (at-prime ?curpos)
        (connected ?curpos ?nextpos)
    )
    :effect (and
        (supporter_turn)
        (not (prime_turn))
        (at-prime ?nextpos)
        (visited ?nextpos)
        (not (at-prime ?curpos))
        (increase (total-cost) 1000.0)
    )
)

(:action pri_noop
    :parameters ()
    :precondition (and
        (prime_turn)
    )
    :effect (and
        (supporter_turn)
        (not (prime_turn))
        (increase (total-cost) 0)
    )
)

(:action sup_noop
    :parameters ()
    :precondition (and
        (supporter_turn)
    )
    :effect (and
        (prime_turn)
        (not (supporter_turn))
        (increase (total-cost) 0)
    )
)

)

; problem
(define (problem joint_visitall-assistance_problem_11)
(:domain joint_visitall-assistance_domain)
(:objects
    node1 node2 node3 node4 node5 node6 node7 node8 node9 - place
)

(:init
    (= (total-cost) 0)
    (supporter_turn)
    (connected node1 node2)
    (connected node1 node3)
    (connected node1 node4)
    (connected node1 node6)
    (connected node1 node8)
    (connected node2 node3)
    (connected node2 node4)
    (connected node2 node7)
    (connected node3 node4)
    (connected node4 node5)
    (connected node5 node6)
    (connected node6 node7)
    (connected node7 node1)
    (connected node7 node8)
    (connected node8 node1)
    (not-connected node1 node5)
    (not-connected node1 node7)
    (not-connected node1 node9)
    (not-connected node2 node1)
    (not-connected node2 node5)
    (not-connected node2 node6)
    (not-connected node2 node8)
    (not-connected node2 node9)
    (not-connected node3 node1)
    (not-connected node3 node2)
    (not-connected node3 node5)
    (not-connected node3 node6)
    (not-connected node3 node7)
    (not-connected node3 node8)
    (not-connected node3 node9)
    (not-connected node4 node1)
    (not-connected node4 node2)
    (not-connected node4 node3)
    (not-connected node4 node6)
    (not-connected node4 node7)
    (not-connected node4 node8)
    (not-connected node4 node9)
    (not-connected node5 node1)
    (not-connected node5 node2)
    (not-connected node5 node3)
    (not-connected node5 node4)
    (not-connected node5 node7)
    (not-connected node5 node8)
    (not-connected node5 node9)
    (not-connected node6 node1)
    (not-connected node6 node2)
    (not-connected node6 node3)
    (not-connected node6 node4)
    (not-connected node6 node5)
    (not-connected node6 node8)
    (not-connected node6 node9)
    (not-connected node7 node2)
    (not-connected node7 node3)
    (not-connected node7 node4)
    (not-connected node7 node5)
    (not-connected node7 node6)
    (not-connected node7 node9)
    (not-connected node8 node2)
    (not-connected node8 node3)
    (not-connected node8 node4)
    (not-connected node8 node5)
    (not-connected node8 node6)
    (not-connected node8 node7)
    (not-connected node8 node9)
    (not-connected node9 node1)
    (not-connected node9 node2)
    (not-connected node9 node3)
    (not-connected node9 node4)
    (not-connected node9 node5)
    (not-connected node9 node6)
    (not-connected node9 node7)
    (not-connected node9 node8)
    (at-prime node1)
    (visited node1)
)

(:goal
  (and
    (visited node2)
    (visited node3)
    (visited node4)
    (visited node5)
    (visited node6)
    (visited node7)
    (visited node8)
    (visited node9)
  )
)
(:metric minimize (total-cost))
)

; plan
1. (sup_create-connection node8 node9)
   deleted: (supporter_turn) (not-connected node8 node9)
   added: (prime_turn) (connected node8 node9)
   goals met: 0 of 8
2. (pri_move node1 node2)
   deleted: (prime_turn) (at-prime node1)
   added: (supporter_turn) (at-prime node2) (visited node2)
   goals met: 1 of 8
3. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 1 of 8
4. (pri_move node2 node3)
   deleted: (prime_turn) (at-prime node2)
   added: (supporter_turn) (at-prime node3) (visited node3)
   goals met: 2 of 8
5. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 2 of 8
6. (pri_move node3 node4)
   deleted: (prime_turn) (at-prime node3)
   added: (supporter_turn) (at-prime node4) (visited node4)
   goals met: 3 of 8
7. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 3 of 8
8. (pri_move node4 node5)
   deleted: (prime_turn) (at-prime node4)
   added: (supporter_turn) (at-prime node5) (visited node5)
   goals met: 4 of 8
9. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 4 of 8
10. (pri_move node5 node6)
   deleted: (prime_turn) (at-prime node5)
   added: (supporter_turn) (at-prime node6) (visited node6)
   goals met: 5 of 8
11. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 5 of 8
12. (pri_move node6 node7)
   deleted: (prime_turn) (at-prime node6)
   added: (supporter_turn) (at-prime node7) (visited node7)
   goals met: 6 of 8
13. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 6 of 8
14. (pri_move node7 node8)
   deleted: (prime_turn) (at-prime node7)
   added: (supporter_turn) (at-prime node8) (visited node8)
   goals met: 7 of 8
15. (sup_noop)
   deleted: (supporter_turn)
   added: (prime_turn)
   goals met: 7 of 8
16. (pri_move node8 node9)
   deleted: (prime_turn) (at-prime node8)
   added: (supporter_turn) (at-prime node9) (visited node9)
   goals met: 8 of 8
